//--------------------------------------------------------------------------------------
//    2024. 2학기 9.24 수                        수78목78                        (6주 2)
//
// 참고 -  C++ CORE GUIDELINE 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험예상
//--------------------------------------------------------------------------------------
// FILE I/O
//--------------------------------------------------------------------------------------

#INCLUDE <IOSTREAM>
#INCLUDE <FSTREAM>
#INCLUDE <PRINT>

#INCLUDE "SAVE.H"

INT MAIN()
{
	//[문제] 파일 "메인.CPP"의 소문자를 모두 대문자로 바꿔 
	// "메인대문자.CPP"에 저장하라 
	//
	//
	//

	STD::IFSTREAM IN{ "소스.CPP" };
	IF (NOT IN) RETURN 404;
	STD::OFSTREAM OUT{ "메인대문자.CPP" };

	CHAR C;
	IN >> STD::NOSKIPWS;
	WHILE (IN >> C) {
		CHAR CH = TOUPPER(C);
		OUT << CH;
		//OUT << STATIC_CAST<CHAR>(TOUPPER(C));
		/*IF (ISLOWER(C)) OUT << STATIC_CAST<CHAR>(C - ('A' - 'A'));
		ELSE OUT << C;*/
	}

	(*SAVE)("소스.CPP");//정석 함수 호출
}

