//--------------------------------------------------------------------------------------
//    2024. 2학기 9.24 수                        수78목78                        (6주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험예상
//--------------------------------------------------------------------------------------
// file I/O
//--------------------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include <print>

#include "save.h"

int main()
{
	//[문제] 파일 "메인.cpp"에 사용된 알파벳 소문자의 개수를 출력하라
	//출력 예
	// a - 10
	// b - 2
	//

	std::ifstream in{ "소스.cpp" };
	if (!in) { return 404; }

	char C;
	int c[26]{};
	while (in >> C) {
		/*for (int i = 'a'; i <='z'; ++i) {
			if (i == C) c[i - 'a'] += 1;
		}*/
		if (islower(C)) {
			c[C - 'a']++;
		}
	}
	for (int i = 0; i < 26; ++i) {
		std::cout << static_cast<char>(i + 'a') << "의 개수는 " << c[i] << std::endl;
	}	//static_cast쓰는 이유 형변환 엄격한 C++에서 유지보수 하기 편하려고 사용

	(*save)("소스.cpp");//정석 함수 호출
}

