//--------------------------------------------------------------------------------------
//    2024. 2학기 11.20 목                        수78목78                        (11주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험
//--------------------------------------------------------------------------------------
// 12/12 목요일 15주 1 - 종강
// 12/18 수요일 15주 2 - 기말
// -------------------------------------------------------------------------------------
// move semantics (이동의미론)
// 
// 
//--------------------------------------------------------------------------------------

#include <iostream>
#include <random>
#include <string>

#include "save.h"

class INT {
private:
	int n{};
public:
	/*INT(){
	}*/
	INT(int n) : n{ n } {
	}
	/*~INT(){
	}*/
	//operator int() const { return n; }	이것도 답으로 인정
	friend std::ostream& operator<<(std::ostream& os, const INT& n);

};
std::ostream& operator<<(std::ostream& os, const INT& n) {
	return os << n.n;
}
int main()
{
	//[문제]클래스 INT를 코딩하여 의도대로 실행되게 하라
	INT n = { 1 };
	std::cout << n << std::endl;
	//std::cout << n++ ++ << std::endl; 빨간줄
	//std::cout << ++++++++++++++n << std::endl;

	save("소스.cpp");
}

