//--------------------------------------------------------------------------------------
//    2024. 2학기 11.20 목                        수78목78                        (13주 1)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험
//--------------------------------------------------------------------------------------
// 12/12 목요일 15주 1 - 종강
// 12/18 수요일 15주 2 - 기말
// 
// 11.27 한 시간 강의 못한 내용 - 동영상으로 일요일까지 업로드 
// 이 반 기말시험은 도형 실습문제를 내기로 말해 버림
// -------------------------------------------------------------------------------------
// 클래스 간의 관계 - 상속( inheritance )
// - 1. 코드 재사용
// - 2. 다형성 구현( dynamic binding )
//--------------------------------------------------------------------------------------

#include <iostream>
#include <string>

#include "save.h"

class Animal {
private:
	int n;
public:
	void move() const {
		std::cout << this << " 움직임 감지" << std::endl;
	}
};

class Dog : public Animal {
private:
	double d;
public:
	void move() const {
		std::cout << "개 달림" << std::endl;
	}
};

class Bird : public Animal {
public:
	//void move() : Animal::move() {}
};

int main()
{
	Dog dog;
	dog.move();
	// 과정은 어떻게 되나?
	// 정의 되어있는 move = void move(Animal*);
	// 우리가 부른 move = void move(Dog*);

	save("소스.cpp");
}
