//--------------------------------------------------------------------------------------
//    2024. 2학기 9.24 수                        수78목78                        (6주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험예상
//--------------------------------------------------------------------------------------
// file I/O
//--------------------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include <print>

#include "save.h"

int main()
{
	//[문제] 파일 "메인.cpp"의 소문자를 모두 대문자로 바꿔 
	// "메인대문자.cpp"에 저장하라 
	//
	//
	//

	std::ifstream in{ "소스.cpp" };
	if (not in) return 404;
	std::ofstream out{ "메인대문자.cpp" };

	char c;
	while (in >> c) {
		if (islower(c)) out << static_cast<char>(c - ('a' - 'A'));
		else out << c;
	}

	(*save)("소스.cpp");//정석 함수 호출
}

