//--------------------------------------------------------------------------------------
//    2024. 2학기 9.24 수                        수78목78                        (6주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험
//--------------------------------------------------------------------------------------
// 사용자 정의 자료형
//--------------------------------------------------------------------------------------

#include <iostream>
#include <string>

#include "save.h"

//struct 와 class를 사용하여 새 자료형을 만든다.

//2차원 점을 표현하는 사용자 정의 자료형


struct Point2D {
	//variable member
	int x;
	int y;

	//function member
	void show() {
		std::cout <<"("<< x << ", " << y <<")" << std::endl;
	}
};


int main()
{	
	Point2D points[100];	//instancing : 메모리에 생성
	for (Point2D point : points) point.show();
	(*save)("소스.cpp");//정석 함수 호출
}

