//--------------------------------------------------------------------------------------
//    2024. 2학기 11.20 목                        수78목78                        (11주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험
//--------------------------------------------------------------------------------------
// 12/12 목요일 15주 1 - 종강
// 12/18 수요일 15주 2 - 기말
// -------------------------------------------------------------------------------------
// move semantics (이동의미론)
// 
// 
//--------------------------------------------------------------------------------------

#include <iostream>
#include <random>
#include <string>

#include "STRING.h"
#include "save.h"

extern bool 관찰;

int main()
{	
	STRING s1 = { "나는 문자열" };
	STRING s2 = std::move(s1);

	std::cout << s1 << std::endl << s2 << std::endl;

	
	save("소스.cpp");
}

//xvalue expired 된 값 
//위의 s1처럼 이동된 빈 값을 가지고 있는 것을 xvalue라고 한다. 

//&	-> ampersand
//int a; int* p = &a;	-> address of n
//int& r = n;			-> reference
//int&& rr = 3;			->rvalue-reference