//--------------------------------------------------------------------------------------
//    2024. 2학기 11.20 목                        수78목78                        (11주 2)
//
// 참고 -  c++ core guideline 
//--------------------------------------------------------------------------------------
// 10.31(목) - 9주 1일차 - 중간 시험
//--------------------------------------------------------------------------------------
// 12/12 목요일 15주 1 - 종강
// 12/18 수요일 15주 2 - 기말
// -------------------------------------------------------------------------------------
// 연산자 오버로딩
// std::string 을 흉내낸 STRING을 작성
// int를 흉내낸 INT를 작성하여 연산자를 오버로딩할 필요성
//--------------------------------------------------------------------------------------

#include <iostream>
#include <random>
#include <string>

#include "STRING.h"
#include "save.h"

extern bool 관찰;




int main()
{	
	//copy elision - RVO(Return Value Optimization)
	관찰 = true;
	STRING s = { "The C++ Programming language!" };

	//[문제] 다음 코드가 의도대로 실행도게 하라
	for (int i = 0; i < s.size(); i++)
	{
		s[i] = std::toupper(s[i]);
	}

	std::cout << s << std::endl;
	//관찰 = false;
	save("소스.cpp");
}


